InformationRegisters/НастройкиСистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСистемыНалогообложения</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнформацияОСтатусеПлательщикаНалогов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетТоваровПоНалогообложениюНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетВНАПоНалогообложениюНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиУчетаЕН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаЕН</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппаПлательщикаЕдиногоНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыПлательщиковЕдиногоНалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицоНеРезидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОрганизацииКлиентЛокализация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Проверяет, что это не новый элемент справочника
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма обработчика:
// 		* Объект - СправочникОбъект -
// 	ИмяФормы - Строка - имя подчиненной формы
// 	ОповещениеПослеЗаписи - ОписаниеОповещения - Описание
// 	ТекстВопроса - Строка - текст вопроса
//
Процедура ПроверитьЧтоЭтоНеНовыйЭлемент(Форма, ИмяФормы, ОповещениеПослеЗаписи, ТекстВопроса = Неопределено) Экспорт
	
	// Проверим, что это не новый элемент справочника.
	Если Не ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
		
		Если ТекстВопроса = Неопределено Тогда
			ТекстВопроса = НСтр("ru='Данные еще не записаны.
|Переход к ""%ИмяФормы%"" возможен только после записи данных.
|Данные будут записаны.'
|;uk='Дані ще не записані.
|Перехід до ""%ИмяФормы%"" можливий тільки після запису даних.
|Дані будуть записані.'");
			ТекстВопроса = СтрЗаменить(ТекстВопроса, "%ИмяФормы%", ИмяФормы);
		КонецЕсли;
		ПараметрыОповещения = Новый Структура("Оповещение, Форма", ОповещениеПослеЗаписи, Форма);
		ПоказатьВопрос(Новый ОписаниеОповещения("ПроверитьЧтоЭтоНеНовыйЭлементОбработкаОтвета", ЭтотОбъект, ПараметрыОповещения), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОповещениеПослеЗаписи);
	
КонецПроцедуры

// Возвращает фильтр, используемый для выбора файлов-изображений.
// Возвращаемое значение:
// Строка - строка, содержащая фильтр для файлов-изображений.
//
Функция ФильтрФайловИзображений() Экспорт
	Возврат НСтр("ru='Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf
                  |Все файлы(*.*)|*.*
                  |Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle
                  |Формат GIF(*.gif*)|*.gif
                  |Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg
                  |Формат PNG(*.png*)|*.png
                  |Формат TIFF(*.tif)|*.tif
                  |Формат icon(*.ico)|*.ico
                  |Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf'
                  |;uk='Всі картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf
                  |Усі файли(*.*)|*.*
                  |Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle
                  |Формат GIF(*.gif*)|*.gif
                  |Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg
                  |Формат PNG(*.png*)|*.png
                  |Формат TIFF(*.tif)|*.tif
                  |Формат icon(*.ico)|*.ico
                  |Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf'");
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормыЭлемента

// Обработчик события ПослеЗаписи формы элемента справочника Организации
//
// Параметры:
//  ПараметрыЗаписи - Структура - структура, содержащая параметры записи.
//  Форма           - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//
Процедура ПослеЗаписи(ПараметрыЗаписи, Форма) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Обработчик события ПослеЗаписи формы элемента справочника Организации
//
// Параметры:
//  Отказ           - Булево - признак отказа.
//  ПараметрыЗаписи - Структура - структура, содержащая параметры записи.
//  Форма           - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи, Форма) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Обработчик события ОбработкаВыбора формы элемента справочника Организации
// 
// Параметры:
// 	ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
// 	ИсточникВыбора    - Произвольный - Форма-источник события.
//  Форма             - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора, Форма) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Обработчик события ОбработкаОповещения формы элемента справочника Организации
//
// Параметры:
//  см. описание платформенного метода ОбработкаОповещения
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник, Форма) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Обработчик события ПриЗакрытии формы элемента справочника Организации
//
// Параметры:
//  ЗавершениеРаботы - Булево - признак завершения работы.
//  Форма - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//
Процедура ПриЗакрытии(ЗавершениеРаботы, Форма) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Обработчик события ПриЗакрытии формы элемента справочника Организации
//
// Параметры:
//  Отказ - Булево - признак отказа.
//  ЗавершениеРаботы - Булево - признак завершения работы.
//  ТекстПредупреждения - Строка - текст предупреждения.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//  Форма - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка, Форма) Экспорт
	//++ Локализация	
	//-- Локализация	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

Процедура Нажатие_Организации(Элемент, СтандартнаяОбработка, Форма) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

Процедура ОбработкаНавигационнойСсылкиФормы_Организации(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	//++ Локализация
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьНастройкиСистемыНалогообложения" Тогда
		ПроверитьЧтоЭтоНеНовыйЭлемент(Форма,
			НСтр("ru='Настройки системы налогообложения';uk='Настройки системи оподаткування'"),
			Новый ОписаниеОповещения("ОткрытьНастройкиСистемыНалогообложенияОбъектЗаписан", 
				ЭтотОбъект,
				Новый Структура("Форма", Форма)));
	КонецЕсли;
    Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьНастройкиУчетаЕН" Тогда
		ПроверитьЧтоЭтоНеНовыйЭлемент(Форма,
			НСтр("ru='Настройки учета ЕН';uk='Настройки обліку ЄП'"),
            Новый ОписаниеОповещения("ОткрытьНастройкиУчетаЕНОбъектЗаписан", 
				ЭтотОбъект,
				Новый Структура("Форма", Форма)));
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ЗапуститьОбработкуКопированияНастроек" Тогда
		ПроверитьЧтоЭтоНеНовыйЭлемент(Форма,
			НСтр("ru='Помощник копирования настроек учетной политики';uk='Помічник копіювання настройок облікової політики'"),
			Новый ОписаниеОповещения("ОткрытьПомощникКопированияНастроекОбъектЗаписан",
			ЭтотОбъект,
			Новый Структура("Форма, КопированиеИзДругойОрганизации", Форма, Ложь)));
			
	КонецЕсли;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ЗапуститьОбработкуКопированияНастроекИзДругойОрганизации" Тогда
		ПроверитьЧтоЭтоНеНовыйЭлемент(Форма,
			НСтр("ru='Помощник копирования настроек учетной политики';uk='Помічник копіювання настройок облікової політики'"),
			Новый ОписаниеОповещения("ОткрытьПомощникКопированияНастроекОбъектЗаписан",
			ЭтотОбъект,
			Новый Структура("Форма, КопированиеИзДругойОрганизации", Форма, Истина)));
		
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

Процедура СкопироватьНастройкиЗавершение(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Или Результат = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура();
	ИмяСобытия = "ЗаписьНастроекНалоговУчетныхПолитик";
	Оповестить(ИмяСобытия, ПараметрыОповещения);
	
КонецПроцедуры

Процедура ПриИзмененииРеквизита(Элемент, Форма) Экспорт
	//++ Локализация
	Если Элемент.Имя = "ИндивидуальныйПредприниматель" Тогда
		ИндивидуальныйПредпринимательПриИзменении(Элемент, Форма);
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

Процедура ОкончаниеВводаТекста_Организации(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка, Форма) Экспорт
	//++ Локализация
    //Если Элемент.Имя = "ИНН"
    //	ПриОкончанииВводаИНН(Текст, Форма);
    //КонецЕсли;
	Если Элемент.Имя = "КодПоЕДРПОУ" Тогда
		ПриОкончанииВводаКодПоЕДРПОУ(Текст, Форма);
    КонецЕсли;
	//-- Локализация
КонецПроцедуры

Процедура НачалоВыбора_Организации(Элемент, ДанныеВыбора, СтандартнаяОбработка, Форма) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыЭлемента

Процедура ВыполнитьКомандуЛокализации(Команда, Форма) Экспорт
	//++ Локализация
    Если Команда.Имя = "ОткрытьПараметрыПФ" Тогда
        ОткрытьПараметрыПФ(Команда, Форма);
	КонецЕсли;
	Если Команда.Имя = "ОткрытьПараметрыФСС" Тогда
		ОткрытьПараметрыФСС(Команда, Форма);
	КонецЕсли;
	Если Команда.Имя = "ОткрытьПараметрыКлассификаторов" Тогда
		ОткрытьПараметрыКлассификаторов(Команда, Форма);
	КонецЕсли;
	Если Команда.Имя = "ОткрытьПараметрыРасчетаЗарплаты" Тогда
		ОткрытьПараметрыРасчетаЗарплаты(Команда, Форма);
	КонецЕсли;
	Если Команда.Имя = "ОткрытьКадровыйУчетИРасчетЗарплаты" Тогда
		ОткрытьКадровыйУчетИРасчетЗарплаты(Команда, Форма);
	КонецЕсли;
	
	Если Команда.Имя = "ОткрытьСпециальныеРежимыЗарплатаКадры" Тогда
		ОткрытьСпециальныеРежимыЗарплатаКадры(Команда, Форма)
	КонецЕсли;	
	
	Если Команда.Имя = "ОткрытьБухучетИВыплатуЗарплаты" Тогда
		ОткрытьБухучетИВыплатуЗарплаты(Команда, Форма);
	КонецЕсли;
	
	Если Команда.Имя = "ОткрытьПараметрыГосРегистрации" Тогда
		ОткрытьПараметрыГосРегистрации(Команда, Форма);
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация
#Область ОбработчикиСобытийЭлементовШапкиФормы_Служебные

//++ НЕ БЗК
#Область НалогиУчетныеПолитики

Процедура ОткрытьНастройкиСистемыНалогообложенияОбъектЗаписан(Результат, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	ОткрытьФорму("РегистрСведений.НастройкиСистемыНалогообложения.ФормаЗаписи",
		Новый Структура("Организация", Форма.Объект.Ссылка),
		Форма,,,,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры


Процедура ОткрытьНастройкиУчетаЕНОбъектЗаписан(Результат, ДополнительныеПараметры) Экспорт    
	
	Форма = ДополнительныеПараметры.Форма;
    ОткрытьФорму("РегистрСведений.НастройкиУчетаЕН.ФормаЗаписи",
		Новый Структура("Организация", Форма.Объект.Ссылка),
		Форма,,,,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры


Процедура ОткрытьПомощникКопированияНастроекОбъектЗаписан(Результат, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	ЗакрытиеФормыПомощникКопированияНастроек =  Новый ОписаниеОповещения("СкопироватьНастройкиЗавершение",
													ЭтотОбъект,
													Новый Структура("Форма", Форма));
	ОчиститьСообщения();
	ОткрытьФорму("Обработка.ПомощникКопированияНастроекУчетныхПолитик.Форма.Форма",
			Новый Структура("Организация, КопированиеИзДругойОрганизации", Форма.Объект.Ссылка, ДополнительныеПараметры.КопированиеИзДругойОрганизации),
			Форма,,,,
			ЗакрытиеФормыПомощникКопированияНастроек,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
КонецПроцедуры

#КонецОбласти
//-- НЕ БЗК

Процедура ИндивидуальныйПредпринимательПриИзменении(Элемент, Форма)
	ПараметрыОбработки = Новый Структура();

	Если НЕ ЗначениеЗаполнено(Форма.Объект.ИндивидуальныйПредприниматель) Тогда
		Форма.Объект.КодПоЕДРПОУ = "";
		ПараметрыОбработки.Вставить("ИмяПроцедуры", "УправлениеФормойНаСервере")
	Иначе
		Форма.Объект.КодПоЕДРПОУ = ОрганизацииВызовСервераЛокализация.ИзменитьКодПоЕДРПОУ(Форма.Объект.ИндивидуальныйПредприниматель);
	КонецЕсли;
	
	ФИОФизическогоЛица = ОрганизацииВызовСервераЛокализация.ПолучитьФИОФизическогоЛица(Форма.Объект.ИндивидуальныйПредприниматель);
	
	Форма.ФИОИндивидуальногоПредпринимателя	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2 %3",
		ФИОФизическогоЛица.Фамилия, ФИОФизическогоЛица.Имя, ФИОФизическогоЛица.Отчество);
		
	Форма.Объект.НаименованиеСокращенное	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='ФЛП %1 %2 %3';uk='ФОП %1 %2 %3'"),
		ФИОФизическогоЛица.Фамилия,
		?(ПустаяСтрока(ФИОФизическогоЛица.Имя), "", Лев(ФИОФизическогоЛица.Имя, 1) + "."),
		?(ПустаяСтрока(ФИОФизическогоЛица.Отчество), "", Лев(ФИОФизическогоЛица.Отчество, 1) + "."));
		
	Форма.Объект.НаименованиеПолное	= "";
	ОбщегоНазначенияУТКлиент.ПродолжитьИзменениеРеквизита(Форма, "НаименованиеСокращенное", Истина, ПараметрыОбработки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы_Контрагенты_Служебные

Процедура ОткрытьПараметрыПФ(Команда, Форма)    
	
	
	Возврат; // в УТ пустой
	
КонецПроцедуры

Процедура ОткрытьПараметрыПФОбъектЗаписан(Результат, ДополнительныеПараметры) Экспорт    
	
	Форма = ДополнительныеПараметры.Форма;
	
	
	Возврат; // в УТ пустой
	
КонецПроцедуры

Процедура ОткрытьПараметрыПФЗавершение(Результат, ДополнительныеПараметры) Экспорт    
	
	
	Возврат; // в УТ пустой
	
КонецПроцедуры

Процедура ОткрытьПараметрыФСС(Команда, Форма)
		
	Возврат;

КонецПроцедуры


Процедура ОткрытьПараметрыКлассификаторов(Команда, Форма)
	
	Возврат;

КонецПроцедуры

Процедура ОткрытьПараметрыГосРегистрации(Команда, Форма)
	
	ПроверитьЧтоЭтоНеНовыйЭлемент(Форма,
		НСтр("ru='Государственная регистрация';uk='Державна реєстрація'"),
		Новый ОписаниеОповещения("ОткрытьПараметрыГосРегистрацииОбъектЗаписан", ЭтотОбъект, Новый Структура("Форма", Форма)));
	
КонецПроцедуры

Процедура ОткрытьПараметрыГосРегистрацииОбъектЗаписан(Результат, ДополнительныеПараметры) Экспорт
	Форма = ДополнительныеПараметры.Форма;
	Объект = Форма.Объект;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидОрганизации", Форма.ВидОрганизации);
    
	СтруктураПараметров.Вставить("ДатаРегистрации", 	Объект.ДатаРегистрации);
	СтруктураПараметров.Вставить("НомерРегистрации",    Объект.НомерРегистрации);
	СтруктураПараметров.Вставить("КемЗарегистрирована", Объект.КемЗарегистрирована);
    
	ОткрытьФорму("Справочник.Организации.Форма.ФормаПараметровГосРегистрации", 
		СтруктураПараметров, 
		Форма,,,, 
		Новый ОписаниеОповещения("ОткрытьПараметрыГосРегистрацииЗавершение", ЭтотОбъект, Новый Структура("Форма", Форма)),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОткрытьПараметрыГосРегистрацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Форма = ДополнительныеПараметры.Форма;
	СтруктураПараметров = Результат;

	Если ЗначениеЗаполнено(СтруктураПараметров)
			И СтруктураПараметров <> КодВозвратаДиалога.Отмена Тогда
		ЗаполнитьЗначенияСвойств(Форма.Объект, СтруктураПараметров);
		Форма.Модифицированность = Истина;
		ОбщегоНазначенияУТКлиент.ПродолжитьВыполнениеКоманды(ДополнительныеПараметры.Форма, "ЗаполнитьОписаниеГосРегистрации", Истина);
	КонецЕсли;

	Возврат;

КонецПроцедуры

Процедура ОткрытьПараметрыРасчетаЗарплаты(Команда, Форма)
	
	Возврат;

КонецПроцедуры


Процедура ОткрытьКадровыйУчетИРасчетЗарплаты(Команда, Форма)
	
	Возврат;
КонецПроцедуры

Процедура ОткрытьБухучетИВыплатуЗарплаты(Команда, Форма)
	Возврат;
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьСпециальныеРежимыЗарплатаКадры(Команда, Форма)
    Возврат;

КонецПроцедуры






#КонецОбласти


#Область МетодыДляОбработчиковСобытийФормы


Процедура ПриОкончанииВводаКодПоЕДРПОУ(ТекстРедактирования, Форма)	
	
	Перем ТекстСообщения;
	ОчиститьСообщения();
	
	ЭтоЮрЛицо = Форма.Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо")
		ИЛИ Форма.Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент");
	
	Если НЕ ПустаяСтрока(ТекстРедактирования) 
		И НЕ РегламентированныеДанныеКлиентСервер.КодПоЕДРПОУСоответствуетТребованиям(ТекстРедактирования, 
			ЭтоЮрЛицо,
			ТекстСообщения) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			,"Объект.КодПоЕДРПОУ",,);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОкончанииВводаИНН(ТекстРедактирования, Форма) 
	
	Перем ТекстСообщения;
	ЭтоЮрЛицо = Форма.Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо")
		ИЛИ Форма.Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент");
	
	ОчиститьСообщения();
	
	Если НЕ ПустаяСтрока(ТекстРедактирования) 
		И НЕ РегламентированныеДанныеКлиентСервер.ИННПлательщикаНДССоответствуетТребованиям(ТекстРедактирования, 
			ЭтоЮрЛицо, 
			ТекстСообщения) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			,"Объект.ИНН",,);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОкончанииВводаНомерСвидетельства(ТекстРедактирования, Форма) 
	
	Перем ТекстСообщения;
	ЭтоЮрЛицо = Форма.Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо")
		ИЛИ Форма.Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент");
	
	ОчиститьСообщения();
	
	Если НЕ ПустаяСтрока(ТекстРедактирования) 
		И НЕ РегламентированныеДанныеКлиентСервер.НомерСвидетельстваПлательщикаНДССоответствуетТребованиям(ТекстРедактирования, 
			ЭтоЮрЛицо, 
			ТекстСообщения) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			,"НомерСвидетельства",,);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
//-- Локализация

#Область ПрочиеСлужебныеМетоды

Процедура ПроверитьЧтоЭтоНеНовыйЭлементОбработкаОтвета(КодОтвета, ДополнительныеПараметры) Экспорт
	
	Если КодОтвета = КодВозвратаДиалога.ОК Тогда 
		Форма = ДополнительныеПараметры.Форма; // РасширениеУправляемойФормыДляДокумента - 
		
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("НеЗакрыватьФорму", Истина);
		
		ЭлементЗаписан = Форма.Записать(ПараметрыЗаписи);
		
		Если Не ЭлементЗаписан Тогда
			Возврат;
		КонецЕсли;
		
		Оповещение = ДополнительныеПараметры.Оповещение;
		
		ВыполнитьОбработкуОповещения(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДоступныеРегистрыНалоговУчетныхПолитик(МассивРегистров) Экспорт
	//++ Локализация
	МассивРегистров.Добавить("НастройкиСистемыНалогообложения");
    МассивРегистров.Добавить("НастройкиУчетаЕН");
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#КонецОбласти
